read_verilog -sv processor/core/ieu/* processor/core/ifu/* processor/core/mmu/* processor/core/core.sv 

proc; opt;        # Process and optimize the design
hierarchy -top core
proc; opt;
clean
write_json design.json
show core
