read_verilog -sv processor/core/ieu/* processor/core/ifu/* processor/core/mmu/* processor/core/core.sv 

proc; opt;        # Process and optimize the design
hierarchy -top $env(TOP_MODULE)
proc; opt;
clean
write_json obj_dir/$env(TOP_MODULE).json
show $env(TOP_MODULE)
