# Read all logic flavors
read_liberty -lib timing/liberty/sky130_fd_sc_hd__tt_025C_1v80.lib

read_verilog -sv processor/core/ieu/* processor/core/ifu/* processor/core/mmu/* processor/core/core.sv 

synth -top core; flatten

dfflibmap -liberty timing/liberty/sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty timing/liberty/sky130_fd_sc_hd__tt_025C_1v80.lib
stat